Revit 2024 API
BuiltInFailures.DimensionFailures.ArcLengthDimensionReferencesNotIntersect Property
 One or more dimension references of this Arc Length dimension no longer intersect the circle needed for arc length computation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ArcLengthDimensionReferencesNotIntersect { get; }
Visual Basic
Public Shared ReadOnly Property ArcLengthDimensionReferencesNotIntersect As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ArcLengthDimensionReferencesNotIntersect {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace